["Ciao","Chuck Norris once drank so many beers he caused prohibition","Like President Obama Chuck Norris also recieved the Nobel peace prize for doing nothing, but in Chucks case millions of lives were saved..","What came first the Chicken or the egg? Chuck Norris did.","GOD created the world in 6 days, what did he do on his rest day? HE CREATED CHUCK NORRIS","Davy Crockett shot his first bear when he was only 3. Chuck Norris roundhouse kicked his first bear into oblivion when he was only 6 months old.","Chuck Norris once turned a mountain into a molehill.","Chuck Norris can keep any character played by Sean Bean alive.","Attila the Hun soiled his pants when he heard that Chuck Norris was on sabbatical in the next village to be conquered.","Every Thanksgiving, millions of people are thankful that Chuck Norris has allowed them to continue to live.","Chuck Norris' snot has the same properties as C-4 explosive.","Chuck Norris ejaculates pure liquid mercury","Chuck Norris was expelled from the 5th grade when he took Steve, his pet Velociraptor for show and tell.","Chuck Norris uses a tanned and cured ox scrotum as a hackey-sack.","Chuck Norris once found the mammary glands on his pet alligator. He milks her every morning and uses it to foam his morning lattes.","Chuck Norris's sex position is.......CHUCK FUCK!","Chuck Norris won an arm wrestling contest with both hands tied behind his back","Chuck Norris can parallel park a freight train","Chuck Norris can knock you down with a feather. But he prefers a savage roundhouse kick to the brain.","Chuck Norris can finish Mario Bros without using the jump button.","Alcohol only makes Chuck Norris a stronger, louder, more efficient American killing machine.","Chewbacca says \"Sir\" to no one except Chuck Norris","Even if Chuck Norris is entirely tied with metal chains, he'll still kick your ass","Helen Keler's favorite color is Chuck Norris","Newtons third law of motion states that Every action has a reaction equal in magnitude and opposite in direction When Chuck Norris uses his roundhouse kick there is only action.","Chuck Norris always have butterflies in his stomach because he eats butterflies for breakfast","Chuck Norris was hit by a train and the train was found 3 days later beyond recognition","Chuck Norris doesn't get sucked away into tornadoes. The tornado gets sucked away into Chuck Norris.","Chuck Norris' Texas Ranger softball team won unexpectedly 150 to 0 in the bottom first inning when in foul territory he ran down and caught a Golden Snitch.","On Thursdays, Chuck Norris plays 7 Card Stud with The Moon, a grizzly and Gomez Adams.","Chuck Norris can hit a banjo in the butt with a bull.","Chuck Norris does not believe in discrimination based on sex, age, race, religion, culture or geography - when it comes to his roundhouse kicks.","Chuck Norris once rounded up every American who was a left-wing, tree-hugging, queer-lovin', anti-gun-ownin' Commie-Pacifist and banished them North. This is the story of how Canada was founded.","The rope that they made to hang Saddam Hussien was made out of Chuck Norris' beard hair. It never released its grip.","The United Nations has known for many years that Chuck Norris contains weapons of mass destruction, but NOBODY enters Chuck Norris!","Chuck Norris toilet is made of stainless steel.","once upon a time Chuck Norris seen a mime\"hello\" said chuck the mime didnt answer so he round house kicked him to death.","Chuck Norris once sniped 20 people with one round. Luckily he forgot the gun","When Chuck Norris was denied an Egg McMuffin at McDonald's because it was 10:35, he roundhouse kicked the store so hard it became a Wendy's.","Chuck Norris gets more ass than a toilet seat at the Irritable Bowel Syndrome Sufferer's annual national convention","Chuck Norris can see the Illuminati but the Illuminati can't see Chuck Norris.","Elmo was originally blue and had a deep voice. Then Chuck Norris roundhouse kicked him 4 times. The last kick changed his voice.","If Charlie S+heen is winning, its only because Chuck Norris isn't playing.","Chuck Norris knows the other fourteen letters of the alphabet.","Why did the chicken cross the road? To get away from Chuck Norris...it never made it to the other side.","Chuck lives forever - You really want to know what happened to the dinosaurs? One of them made fun of Chuck Norris's 'stache.","Chuck Norris doesnt clean house the house cleans him","Chuck Norris does not scream while riding rollercoasters, rollercoasters scream while being ridden by Chuck Norris.","Chuck Norris likes his ice like he likes his skulls: crushed.","Some people balance eggs on end every Spring and Fall Equinox, but Chuck Norris balances skulls.","On his Driver's License: Dr Lic#: I'm Chuck Norris Expiration Date: Tomorrow Soc Sec#: 1 Height: Kiss my ass Weight: Benches 885 Eyes: Bloodshot Sex: Yes, frequently Organ Donor: Yes, over 4,603","Chuck Norris' penis sleeps in a seperate bed.","Chuck Norris doesn't feel your pain... he causes it","People add inches to their biceps by using dumbbells; people add a foot to their bicep submitting Chuck Norris facts.","Banks don't do public holidays but Chuck Norris does","The current stock market crash began when Chuck Norris faxed a Roundhouse kick to Wall Street","Chuck Norris visited this website before. But he didn't submit a fact, he looked all 8616 facts. That includes this fact.","Chuck Norris shaves with a belt sander","Chuck Norris forced the Beatles to change the lyrics to many of their songs, including \"All You Need Is Chuck\", \"Hey Jude (Chuck Norris Fathered You)\" \"I Am Chuck's Walrus\" and \"Everybody's Got Something To Hide Except Chuck Norris\".","Norris 25:17. \"The path of the righteous man (me) is beset on all sides by the inequities of the dumbasses and the tyranny of suited girlymen. Blessed is he who, in the name of charity and good will, sends boxes of cigars and crates of beer to me. For I am truly the Mack Daddy and the killer of lost children. And I will roundhouse kick thee with great vengeance and furious anger those who attempt to look at me sideways. And you will know I am the Lord, Chuck Norris, when I lay my vengeance upon you.\"","Chuck Norris can walk a tight rope upsidedown.","Chuck Norris lives in a permanent state of chronosynclastic infundibulum.","At McDonalds, Chuck Norris ordered breakfast at 10:40 and was denied because breakfast ends at 10:30. He got so mad , he roundhouse kicked the McDonalds so hard it became Wendy's !xpsl","Chuck Norris can lick his own elbows...both...at the same time","Chuck Norris shot the sheriff. And he shot the deputy.","People who enjoy being green are known as \"tree huggers\". People who enjoy living are known as Chuck Norris huggers.","Remember Child's Play? The doll now hangs from Chuck Norris' rearview mirror.","Chuck Norris puts the cunning in cunnilingus.","Chuck Norris accidentally took down the internet by closing his browser.","Tony the Tiger knows that Chuck Norris is G-R-E-A-T!","wen bruce gets mad he turns into the hulk, wen hulk gets mad he turns into Chuck Norris, wen Chuck Norris gets mad \"RUN!!!!!!!\"","Each time you rate this, Chuck Norris hits Obama with Charlie Sheen and says, \"Who's winning now?!\"","Chuck Norris can make your brown eyes blue...and black.","when alexander gram bell inveted the first phone he already had 2 missed calls from Chuck Norris","If Chuck Norris played baseball, the Texas Rangers would have won the World Series in 2011. And 2010. And every Series dating back to 1972, their first year in Texas.","Chuck Norris' pimp hand be well strong.","Chuck Norris can write a haiku with one syllable.","Chuck Norris once threw a 'block party'. The city of Detroit filed for bankruptcy the next day.","Chuck Norris can timetravel by riding on a donkey. Infact that's how donkeys were introduced to the human civilization in 7000 B.C.","Chuck Norris special orders his pencils without erasers because Chuck Norris doesn't make mistakes.","Chuck Norris favorite artist is Celine Dion. No homo.","Chuck Norris once took his pants off in a Thanksgiving Day parade. All the horses wept. Male and female.","When Chuck Norris was 5, he went to the Mall to see Santa. Santa asked \"what would you like little boy, a train set? A bike? Chuck replied \"no Santa, I want a rocket launcher\".","During a recent talk show interview Chuck Norris was asked what he thought of Justin Bieber. Chuck said he thought Bieber was a waste of perfectly good toilet paper.","Chuck Norris ain't no novice.","Stanford university recently received a scholarship from Chuck Norris","Chuck Norris once revived a dead, beached Humpback Whale by performing CPR and then throwing it back into the Pacific Ocean.","Chuck Norris loves your mother.","Clearly, Chuck Norris has more bad-assedness in his beard than all of the other Expendables combined and squared.","Loosely translated, 'Gangnam' is korean for 'Chuck Norris sodomy'.","Chuck Norris flosses with lightning.","when Chuck norris was 3 years old he snacked on a box of crayons, 2 weeks ago he reportedly shit out a candle, and when i came out, it was lit!"]